In [1]:
library(RSQLite)

In [6]:
db <- dbConnect(SQLite(),'bnames.sqlite')

In [7]:
dbListTables(db)

[1] "babyNames"

In [8]:
dbGetQuery(db,"select name,sum(Count) from babyNames ;")

  Name  sum(Count)
1 Zzyzx 321472269

In [11]:
bob <- dbGetQuery(db,"select name,sum(Count) from babyNames group by Name ;")
str(bob)
tail(bob)

'data.frame':	88584 obs. of  2 variables:
 $ Name      : chr  "Aaban" "Aabid" "Aabriella" "Aadam" ...
 $ sum(Count): int  20 5 5 133 69 109 2985 10 29 5 ...

      Name      sum(Count)
88579 Zyshon     19
88580 Zyshonne  101
88581 Zytavious  43
88582 Zyvion      5
88583 Zyyanna     6
88584 Zzyzx       5

dbGetQuery(db,"select bn.Name,max(bn.Cnt) from bn (select name,sum(Count) as 'Cnt' from babyNames group by Name) "bn" ;")

In [14]:
dbGetQuery(db,"select bn.Name,max(bn.Cnt) from (select Name,sum(Count) as 'Cnt' from babyNames group by Name) 'bn' ;")

  Name  max(bn.Cnt)
1 James 5046253

In [16]:
dbGetQuery(db,"select bn.Sex,max(bn.Cnt) from (select Sex,sum(Count) as 'Cnt' from babyNames group by Sex) 'bn' ;")

  Sex max(bn.Cnt)
1 M   161955468

In [17]:
dbGetQuery(db,"select bn.Sex,bn.Cnt from (select Sex,sum(Count) as 'Cnt' from babyNames group by Sex) 'bn' ;")

  Sex Cnt
1 F   159516801
2 M   161955468

In [23]:
a <- dbGetQuery(db,"select bn.Name,bn.Cnt from (select Name,sum(Count) as 'Cnt' from babyNames where Sex='M' group by Name) 'bn' ;")
str(a)
a[a$Name=='Morris',]

'data.frame':	36795 obs. of  2 variables:
 $ Name: chr  "Aaban" "Aabid" "Aadam" "Aadan" ...
 $ Cnt : int  20 5 133 69 109 2980 10 29 5 444 ...

      Name   Cnt
24754 Morris 69133

In [26]:
dbGetQuery(db,"select bn.Name,max(bn.Cnt) from (select Name,sum(Count) as 'Cnt' from babyNames where Sex='F' group by Name) 'bn' ;")

  Name max(bn.Cnt)
1 Mary 4065412

In [28]:
#Which year had most Mary's
dbGetQuery(db,"select bn.Year,max(bn.Cnt) from (select Year,sum(Count) as 'Cnt' from babyNames where Name='Mary' group by Year) 'bn' ;")

  Year max(bn.Cnt)
1 1921 74172

In [39]:
dbGetQuery(db,"select bn.Name, bn.Year,max(bn.Cnt) from (select Name,Year,sum(Count) as 'Cnt' from babyNames where Name='Sandeep' and Sex='M' group by Year) 'bn' ;")

  Name    Year max(bn.Cnt)
1 Sandeep 1989 32

In [42]:
dbGetQuery(db,"select bn.Name, bn.Year,max(bn.Cnt) from (select Name,Year,sum(Count) as 'Cnt' from babyNames where Name in ('Terry','Teri','Terie') and Sex='M' group by Year) 'bn' ;")

  Name Year max(bn.Cnt)
1 Teri 1957 15625